# Ex 2.6: Part 1(In Class)

- Data file:  **Global Superstore 2016.xlsx**

In [2]:
import pandas as pd

### Read the datafile File into a *pandas* Dataframe

In [3]:
df = pd.read_excel("Data/Sample - Superstore.xlsx", "Orders", skiprows=0)

print(df.shape)
df.head()

(9994, 21)

c:\Users\W10\anaconda3\envs\Cis340_Fall_2022\lib\site-packages\openpyxl\worksheet\header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")

,Row ID,Order ID,Order_Date,Ship Date,Ship Mode,Customer ID,Customer Name,Business_Segment,Country/Region,City,...,Zipcode,Region,Product_ID,Category,Subcategory,Product_Name,Sales,Quantity,Discount,Profit
0,1,CA-2019-152156,2019-11-08,2019-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2019-152156,2019-11-08,2019-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2019-138688,2019-06-12,2019-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2018-108966,2018-10-11,2018-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2018-108966,2018-10-11,2018-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [4]:
# data types 'Before' 
df.dtypes

Row ID                       int64
Order ID                    object
Order_Date          datetime64[ns]
Ship Date           datetime64[ns]
Ship Mode                   object
Customer ID                 object
Customer Name               object
Business_Segment            object
Country/Region              object
City                        object
State                       object
Zipcode                    float64
Region                      object
Product_ID                  object
Category                    object
Subcategory                 object
Product_Name                object
Sales                      float64
Quantity                     int64
Discount                   float64
Profit                     float64
dtype: object

# Q2.1: What are the Total Profits by Region and Business Segment?

In [10]:
ser1 = df.groupby(["Region", 'Business_Segment'])['Profit'].sum()

ser1

Region   Business_Segment
Central  Consumer             8564.0481
         Corporate           18703.9020
         Home Office         12438.4124
East     Consumer            41190.9843
         Corporate           23622.5789
         Home Office         26709.2168
South    Consumer            26913.5728
         Corporate           15215.2232
         Home Office          4620.6343
West     Consumer            57450.6040
         Corporate           34437.4299
         Home Office         16530.4150
Name: Profit, dtype: float64

In [11]:
# First, check that it is a pandas Series
type(ser1)

pandas.core.series.Series

In [12]:
# It is, convert it  to a Dataframe
df_Q1 = ser1.to_frame()

print(df_Q1.shape)
df_Q1

(12, 1)

                              Profit
Region  Business_Segment
Central Consumer           8564.0481
        Corporate         18703.9020
        Home Office       12438.4124
East    Consumer          41190.9843
        Corporate         23622.5789
        Home Office       26709.2168
South   Consumer          26913.5728
        Corporate         15215.2232
        Home Office        4620.6343
West    Consumer          57450.6040
        Corporate         34437.4299
        Home Office       16530.4150

In [13]:
df_Q1.reset_index(inplace=True)

print('Q2.1: What are the Total Profits by Region and Business Segment? ')
print(df_Q1.shape)
df_Q1

Q2.1: What are the Total Profits by Region and Segment?
(12, 3)

     Region Business_Segment      Profit
0   Central         Consumer   8564.0481
1   Central        Corporate  18703.9020
2   Central      Home Office  12438.4124
3      East         Consumer  41190.9843
4      East        Corporate  23622.5789
5      East      Home Office  26709.2168
6     South         Consumer  26913.5728
7     South        Corporate  15215.2232
8     South      Home Office   4620.6343
9      West         Consumer  57450.6040
10     West        Corporate  34437.4299
11     West      Home Office  16530.4150

# Q2.2: Who are the Five Customers with the least average Sales?

In [14]:
ser2 = df.groupby(["Customer Name"])['Sales'].mean()

ser2

Customer Name
Aaron Bergman         147.692667
Aaron Hawkins         158.609091
Aaron Smayling        305.069200
Adam Bellavance       430.867778
Adam Hart             162.516850
                         ...
Xylona Preis           84.809214
Yana Sorensen         560.037000
Yoseph Carroll        681.793750
Zuschuss Carroll      258.893774
Zuschuss Donatelli    165.993778
Name: Sales, Length: 793, dtype: float64

In [15]:
# First, check that it is a pandas Series
type(ser2)

pandas.core.series.Series

In [16]:
# It is, convert it  to a Dataframe
df_Q2 = ser2.to_frame()

print(df_Q2.shape)
df_Q2

(793, 1)

                         Sales
Customer Name
Aaron Bergman       147.692667
Aaron Hawkins       158.609091
Aaron Smayling      305.069200
Adam Bellavance     430.867778
Adam Hart           162.516850
...                        ...
Xylona Preis         84.809214
Yana Sorensen       560.037000
Yoseph Carroll      681.793750
Zuschuss Carroll    258.893774
Zuschuss Donatelli  165.993778

[793 rows x 1 columns]

In [17]:
df_Q2.reset_index(inplace=True)
df_Q2.sort_values(by='Sales', ascending=True, inplace=True)
df_TopN = df_Q2.iloc[ : 5]


print('Q2.2: Who are the Five Customers with the least average Sales? ')
print(df_TopN.shape)
df_TopN

Q2.2: Who are the Five Customers with the least average Sales?
(5, 2)

       Customer Name     Sales
737    Thais Sissman  2.416500
455     Lela Donovan  5.304000
656       Roy Skaria  7.442667
545  Mitch Gastineau  8.369500
724   Susan Gilcrest  9.589200